#!/bin/bash

# Создаем временную папку с уникальным именем
CLONE_DIR=$(mktemp -d)
echo "📦 Клонирование в: $CLONE_DIR"

# Клонируем репозиторий
if ! git clone -b dev --depth 1 https://github.com/DanteFuaran/dfc-shop-bot.git "$CLONE_DIR"; then
    echo "❌ Ошибка при клонировании репозитория"
    rm -rf "$CLONE_DIR"
    exit 1
fi

echo "✅ Репозиторий загружен"

# Переходим в папку и запускаем установку
if ! cd "$CLONE_DIR"; then
    echo "❌ Ошибка при переходе в папку"
    rm -rf "$CLONE_DIR"
    exit 1
fi

# Даём права на выполнение скрипту установки
chmod +x ./install.sh

echo "🚀 Запуск установки..."

# Запускаем скрипт установки
if ! ./install.sh; then
    echo "❌ Ошибка при выполнении установки"
    cd /opt
    rm -rf "$CLONE_DIR"
    exit 1
fi

echo "✅ Установка завершена"

# Удаляем временную папку после установки
cd /opt || exit 1
rm -rf "$CLONE_DIR"

echo "🧹 Очистка завершена"
