#!/bin/bash
set -e

# Создаем временную папку с уникальным именем
CLONE_DIR=$(mktemp -d)
echo "📦 Клонирование в: $CLONE_DIR"

# Клонируем репозиторий
echo "⏳ Загрузка репозитория..."
git clone -b dev --depth 1 https://github.com/DanteFuaran/dfc-shop-bot.git "$CLONE_DIR"

# Переходим в папку
echo "📂 Переходим в папку установки..."
cd "$CLONE_DIR" || exit 1

# Даём права на выполнение скрипту установки
chmod +x ./install.sh

# Запускаем скрипт установки
echo "🚀 Запускаем установку..."
./install.sh

# Удаляем временную папку после установки
echo "🧹 Очистка временных файлов..."
cd /opt || exit 1
rm -rf "$CLONE_DIR"

echo "✅ Установка завершена!"
